//
//  WordsListModel.swift
//  EnglishLearner
//
//  Created by g.semshchikov on 09.01.2023.
//

enum WordsSet: Int {
    case first = 1
    case second = 2
    case third = 3
    case fourth = 4
    case fifth = 5
    case sixth = 6
    case seventh = 7
    case eighth = 8
    case ninth = 9
    case tenth = 10
    
    var definition: [String] {
        switch self{
        case .first:
            return ["Медведь", "Осьминог", "Крыса", "Помидор", "Малина", "Дезодорант", "Бутерброд", "Козырёк", "Банан", "Рысь", "Заяц", "Ножницы", "Ласточка", "Шампиньон", "Омлет", "Вафли", "Ворон", "Аквариум", "Брюки", "Серьги"]
        case .second:
            return ["Кимоно", "Слива", "Шуба", "Сарафан", "Берёза", "Футболка", "Репа", "Шоколад", "Мороженое", "Бочонок", "Ягнёнок", "Сливки", "Дельфин", "Бейсболка", "Врач", "Зубочистка", "Лев", "Виски", "Гусь", "Акула"]
        case .third:
            return ["Вино", "Земляника", "Жеребёнок", "Цветок", "Ягуар", "Мотылёк", "Медвежонок", "Шляпа", "Гадюка", "Смокинг", "Пирог", "Брусника", "Медуза", "Клубника", "Ватрушка", "Енот", "Бабочка", "Перстень", "Туфли", "Антилопа"]
        case .fourth:
            return ["Укроп", "Платье", "Пижама", "Босоножки", "Винегрет", "Абрикос", "Тюрбан", "Перчатки", "Лиса", "Пчела", "Печь", "Олень", "Авокадо", "Тополь", "Подтяжки", "Бекон", "Червь", "Жаба", "Колбаса", "Тюльпан"]
        case .fifth:
            return ["тюлень", "колибри", "виноград", "соломинка", "косметичка", "печенье", "ежевика", "рябина", "гриф", "шишка", "кузнечик", "попугай", "козёл", "смородина", "бюстгальтер", "сыр", "ландыш", "луковица", "лимон", "кролик"]
        case .sixth:
            return ["ястреб", "унитаз", "игуана", "опоссум", "ночной горшок", "яйца", "указательный палец", "марля", "лисица", "волкодав", "вертел", "автобус", "окно", "ноутбук", "мухобойка", "паутина", "кость", "противень", "бутылка", "бриджи"]
        case .seventh:
            return ["душ", "сахар", "жабо", "томатный кетчуп", "муравейник", "пододеяльник", "компот", "рулет мясной", "деловой костюм", "виноградник", "сом", "мельница для кофе", "бобр", "салатница", "шинель", "швабра", "дорожная сумка", "листья", "решетка", "джемпер"]
        case .eighth:
            return ["сапоги", "теремок", "мягкая мебель", "махровое полотенце", "спортивная сумка", "боксер", "макака", "колли", "штепсель", "скворечник", "ворона", "судак", "ванна", "локоть", "выключатель", "кинжал", "корм", "паприка", "пион", "майонез"]
        case .ninth:
            return ["чернильница", "мёд", "магнитофон", "ковбойские сапоги", "газета", "вуаль", "кулак", "клин", "розетка", "отвертка", "кофемолка", "шкура", "ночная рубашка", "снегирь", "лань", "норка", "оса", "миксер", "кальсоны", "осина"]
        case .tenth:
            return ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]
        }
    }
}
